uml-plant/componentes/comp_ms_examenes.puml
@startuml HEPAQ_MS_Examenes_Componentes

skinparam componentStyle rectangle
skinparam backgroundColor #FFFFFF
skinparam ArrowColor #444444
skinparam packageStyle rectangle
skinparam shadowing false

title HEPAQ — MS Exámenes · Diagrama de Componentes

component "Azure API Management\nGateway" as APIM

package "MS Exámenes — Spring Boot WebFlux · Java 21" {

    package "API Layer" {
        component [ExamenesController\n«REST Controller»] as Controller
        component [ExamenDelegate\n«Delegate»] as Delegate
        component [ExamenMapper\n«MapStruct»] as Mapper
    }

    package "Strategy Pattern — Procesamiento por Tipo" {
        component [ExamenStrategyFactory\n«Factory Method»] as StratFactory
        component [LaboratorioExamenStrategy] as LabStrat
        component [ImagenExamenStrategy] as ImgStrat
        component [EcografiaExamenStrategy] as EcoStrat
    }
    StratFactory --> LabStrat
    StratFactory --> ImgStrat
    StratFactory --> EcoStrat

    package "Application (Use Cases)" {
        component [RegistrarExamenUseCase] as RegistrarUC
        component [EditarExamenUseCase] as EditarUC
        component [CancelarExamenUseCase] as CancelarUC
        component [BorrarExamenUseCase] as BorrarUC
    }

    package "Query Side (CQRS)" {
        component [ListarExamenQuery\n«Query Service»] as ListarQ
        component [ObtenerExamenQuery\n«Query Service»] as ObtenerQ
    }

    package "Event Consumers" {
        component [RegistrarExamenConsumer\n«Service Bus Consumer»] as RegistrarConsumer
    }

    package "Adapters Outbound" {
        component [ExamenJpaAdapter\n«JPA Adapter»] as JpaAdp
        component [ExamenCosmosAdapter\n«Cosmos Adapter»] as CosmosAdp
        component [ExamenRedisAdapter\n«Redis Adapter»] as RedisAdp
        component [BlobStorageAdapter\n«Blob Storage Adapter»] as BlobAdp
        component [ServiceBusPublisher\n«Service Bus Adapter»] as SBPub
    }
}

database "Azure SQL Database\nWrite Model" as SQL
database "Azure Cosmos DB\nRead Model" as CosmosDB
database "Azure Cache for Redis" as RedisDB
storage "Azure Blob Storage\nDICOM · PDF · Imágenes · MP4" as Blob
queue "Azure Service Bus\nTopics / Subscriptions" as SB

APIM --> Controller
Controller --> Delegate
Delegate --> Mapper
Delegate --> EditarUC
Delegate --> CancelarUC
Delegate --> BorrarUC
Delegate --> ListarQ
Delegate --> ObtenerQ

SB --> RegistrarConsumer : ExamenOrigenEvent
RegistrarConsumer --> RegistrarUC

RegistrarUC --> StratFactory
RegistrarUC --> JpaAdp
EditarUC --> JpaAdp
CancelarUC --> JpaAdp
BorrarUC --> JpaAdp
RegistrarUC --> CosmosAdp
EditarUC --> CosmosAdp
RegistrarUC --> RedisAdp
EditarUC --> BlobAdp
RegistrarUC --> SBPub
CancelarUC --> SBPub

JpaAdp --> SQL
CosmosAdp --> CosmosDB
RedisAdp --> RedisDB
BlobAdp --> Blob
SBPub --> SB

@enduml
